Reports/ОтчетПоПодтверждениямКладовщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>ОтчетПоПодтверждениямКладовщиков</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ТоварыПодтвержденныеКладовщикомПриСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТоварыПодтвержденныеКладовщикомПриСборке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПоОрдеру</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоКорректировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комплектовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Расходник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерСклад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ОтчетПоПодтверждениямКладовщиков/Forms/ФормаРасшифровки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерСкладТовары.Ссылка,
		|	РасходныйОрдерСкладТовары.Получатель
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	Документ.РасходныйОрдерСклад КАК РасходныйОрдерСкладТовары
		|ГДЕ
		|	РасходныйОрдерСкладТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасходныйОрдерСкладТовары.Номенклатура,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ЗначенияСвойствОбъектов.Значение = 0
		|					ТОГДА 0
		|				ИНАЧЕ РасходныйОрдерСкладТовары.КоличествоУРЗ / (ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК ЧИСЛО(15, 2)))
		|			КОНЕЦ КАК ЧИСЛО(15, 1))) КАК КоличествоКоробокУРЗ,
		|	РасходныйОрдерСкладТовары.Характеристика,
		|	РасходныйОрдерСкладТовары.КоличествоУРЗ
		|ПОМЕСТИТЬ втРасп
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерСклад.Товары КАК РасходныйОрдерСкладТовары
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|			ПО РасходныйОрдерСкладТовары.Характеристика = ЗначенияСвойствОбъектов.Объект
		|				И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке))
		|		ПО вт.Ссылка = РасходныйОрдерСкладТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходныйОрдерСкладТовары.Номенклатура,
		|	РасходныйОрдерСкладТовары.Характеристика,
		|	РасходныйОрдерСкладТовары.КоличествоУРЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Кладовщик,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Комплектовщик,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Расходник,
		|	вт.Получатель КАК ТТ,
		|	СУММА(ВЫРАЗИТЬ(ВЫБОР
		|				КОГДА ЗначенияСвойствОбъектов.Значение = 0
		|					ТОГДА 0
		|				ИНАЧЕ (ЕСТЬNULL(втРасп.КоличествоУРЗ, 0) - ТоварыПодтвержденныеКладовщикомПриСборке.КоличествоПоОрдеру) / (ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Значение КАК ЧИСЛО(15, 2)))
		|			КОНЕЦ КАК ЧИСЛО(15, 1))) КАК КоличествоКоробокПодтвержденное,
		|	СУММА(ТоварыПодтвержденныеКладовщикомПриСборке.КоличествоПоОрдеру) КАК КоличествоПодтвержденное,
		|	СУММА(ТоварыПодтвержденныеКладовщикомПриСборке.КоличествоКорректировка) КАК КоличествоКорректировка,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Номенклатура КАК Номенклатура,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Характеристика КАК Характеристика,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.ДатаПроизводства,
		|	СУММА(ЕСТЬNULL(втРасп.КоличествоУРЗ, 0)) КАК КоличествоУРЗ
		|ИЗ
		|	РегистрСведений.ТоварыПодтвержденныеКладовщикомПриСборке КАК ТоварыПодтвержденныеКладовщикомПриСборке
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
		|		ПО ТоварыПодтвержденныеКладовщикомПриСборке.Расходник = вт.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ТоварыПодтвержденныеКладовщикомПриСборке.Характеристика = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.КоличествоВУпаковке))
		|		ЛЕВОЕ СОЕДИНЕНИЕ втРасп КАК втРасп
		|		ПО ТоварыПодтвержденныеКладовщикомПриСборке.Номенклатура = втРасп.Номенклатура
		|			И ТоварыПодтвержденныеКладовщикомПриСборке.Характеристика = втРасп.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Кладовщик,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Комплектовщик,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Расходник,
		|	вт.Получатель,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Номенклатура,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.Характеристика,
		|	ТоварыПодтвержденныеКладовщикомПриСборке.ДатаПроизводства
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика";
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Параметры.Расходник.ДатаРаспределения));
	Запрос.УстановитьПараметр("Ссылка", Параметры.Расходник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Мак=Отчеты.ОтчетПоПодтверждениямКладовщиков.ПолучитьМакет("Макет");
	Шапка=Мак.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Шапка);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Шапка=Мак.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(Шапка.Параметры,ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(Шапка);
	КонецЦикла;
	
	
КонецПроцедуры
